#define bGM_close
{
   /********************************************************************************
    * (ver 1.0.0)
    *
    * bGM_close(sound_id)
    *
    * サウンドを完全停止させ、ファイルも閉じさせる。
    * この後はもちろんsound_idも無効となる。
    *
    * -int   sound_id    : 完全停止させたいサウンドid (bGM_playの戻り値)
    *
    * return        : 戻り値無し。
    ********************************************************************************/

   /* ------------------- 以下、変更不可 ------------------- */

   bGM_private_controll_1arg(argument0, "d");
   exit;
}
