#define bGM_set_pitch
{
   /********************************************************************************
    * (ver 1.0.0)
    *
    * bGM_set_pitch(sound_id, pitch)
    *
    * サウンドの再生スピード(ピッチシフト値)を変更させる。
    *
    * -int   sound_id    : 対象のサウンドid (bGM_playの戻り値)
    * -double  pitch     : 再生スピード(0.5～2.0で指定する)
    *
    * return        : 戻り値無し。
    ********************************************************************************/

   /* ------------------- 以下、変更不可 ------------------- */

   bGM_private_controll_1arg(argument0, "s " + string_format(argument1, 7, 6));
   exit;
}
