{
   /********************************************************************************
    * (ver 1.0.0)
    *
    * bGM_set_pan(sound_id, pan)
    *
    * サウンドのパン(左右の音量の比率)を変更させる。
    *
    * -int   sound_id    : 対象のサウンドid (bGM_playの戻り値)
    * -double  pan       : パンの数値(-1.0で左端、0.0で中央、1.0で右端)
    *
    * return        : 戻り値無し。
    ********************************************************************************/

   /* ------------------- 以下、変更不可 ------------------- */

   bGM_private_controll_1arg(argument0, "p " + string_format(argument1, 7, 6));
   exit;
}
