#define bGM_set_volume
{
   /********************************************************************************
    * (ver 1.0.0)
    *
    * bGM_set_volume(sound_id, volume)
    *
    * サウンドの音量を変更させる。
    *
    * -int   sound_id    : 音量を調節したいサウンドid (bGM_playの戻り値)
    * -double  volume    : 音量(0.0～1.0で指定する)
    *
    * return        : 戻り値無し。
    ********************************************************************************/

   /* ------------------- 以下、変更不可 ------------------- */

   bGM_private_controll_1arg(argument0, "v " + string_format(argument1, 7, 6));
   exit;
}
